////// Metadata header
/////
////
///
//
export const META_TITLE =
  "Taxemu - Υπολογισμός καθαρού ή μικτού μισθού μισθωτού ή ατομικής επιχείρησης";
export const META_DESCRIPTION =
  "Το Taxemu είναι ενα open-source εργαλείο για να μπορείς να έχεις μια εικόνα των εξόδων και κρατήσεων της ατομικής σου επιχείρησης";

export const CONTENT = {
  employee: {
    title: "Υπολογισμός μισθωτού",
    subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
  },
  business: {
    title: "Υπολογισμός ελεύθερου επαγγελματία",
    subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
  },
};

export const EMPLOYEE_WIKI = [
  {
    title: "Ασφαλιστικές εισφορές",
    description:
      "Οι ασφαλιστικές εισφορές του εργαζομένου προκύπτουν από την εφαρμογή ενός ποσοσού επι το μικτού μισθού.",
    list: [],
    example: `Για ένα μικτό μηνιαίο €2000 και με το
      ποσοστό των ασφαλιστικών εισφορών που παρακρατούνται να
      είναι στο 13.867%: μικτό μηνιαίο * 0.13867 = ασφαλιστικές
      εισφορές ανά μήνα`,
  },
  {
    title: "Φόρος εισοδήματος",
    description:
      "Για τον υπολογισμό χρησιμοποιείται το ετήσιο φορολογητέο εισόδημα αφότου γίνει η αφαίρεση τον ασφαλιστικών εισφορών, και ο φόρος υπολογίζεται κλιμακωτά.",
    list: [
      "€0-€10.000 → 9%",
      "€10.000-€20.000 → 22%",
      "€20.000-€30.000 → 28%",
      "€30.000-€40.000 → 36%",
      "€40.000+ → 44%",
    ],
    example: "Με ετήσιο φορολογητέο εισόδημα €17.232 προκύπτει:",
    exampleList: [
      "€10.000 * 0.09 = €900",
      "€7.232 * 0.22 = €1591",
      "σύνολο = €2491",
    ],
  },
  {
    title: "Έκπτωση φόρου",
    description:
      "Η έκπτωση φόρου εισοδήματος για μισθωτούς εξαρτάται από τον αριθμό των προστατευομενων τέκνών. Για εισοδήματα κάτω τον €12.000 είναι οι εξής:",
    list: [
      "€777, εάν δεν υπάρχουν προστατευόμενα τέκνα",
      "€810, εάν υφίσταται ένα προστατευόμενο τέκνο",
      "€900, εάν υπάρχουν δύο προστατευόμενα τέκνα",
      "€1.120, εάν υφίστανται τρία προστατευόμενα τέκνα",
      "€1.340, εάν υφίστανται τέσσερα προστατευόμενα τέκνα",
      "επιπλέον €220 για κάθε προστατευόμενο τέκνο από το πέμπτο και πάνω",
    ],
    afterListDescritpion:
      "Αν το εισοδήματα υπερβαίνει τα €12.000 η έκπτωση μειώνεται κατά €20 ανά €1.000.",
    example:
      "Για ένα ετήσιο φορολογητέο εισόδημα €17.232 και χωρίς προστατευόμενα τέκνα. Aρχική έκπτωση €777. Δεδομένου ότι το ποσό υπερβαίνει τα €12.000 κάνουμε την απαραίτητη μείωση.",
    exampleList: [
      "€17.232 - €12.000 = €5.232",
      "€5.232 * 0.02 = €104",
      "€777 - €104 = €673",
    ],
    afterExampleList:
      "Άρα για φόρο €2491 η έκπωση φορου θα ειναι €777 - €104 = €673. Τελικός φόρος: €2491 - €673 = €1818",
  },

  {
    title: "Μεταφορά φορολογικής κατοικίας στην Ελλάδα",
    description:
      "Η έκπτωση φόρου εισοδήματος για μισθωτούς εξαρτάται από τον αριθμό των προστατευομενων τέκνών. Για εισοδήματα κάτω τον €12.000 είναι οι εξής:",
    list: [],
    example:
      "ετήσιο φορολογητέο εισόδημα * 0.5 ⇒ κλίμακες(9%, 22%, 28%, 36%, 44%)",
  },
];

export const WIKI = {
  employee: {
    header: {
      title: "Υπολογισμός μισθωτού",
      subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
    },
    content: EMPLOYEE_WIKI,
  },
  business: {
    header: {
      title: "Υπολογισμός ελεύθερου επαγγελματία",
      subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
    },
    content: [],
  },
};
