///////////////////////////////
///// metadata for head //////
/////////////////////////////
export const META_TITLE =
  "Taxemu - Υπολογισμός καθαρού ή μικτού μισθού μισθωτού ή ατομικής επιχείρησης";
export const META_DESCRIPTION =
  "Το Taxemu είναι ενα open-source εργαλείο για να μπορείς να έχεις μια εικόνα των εξόδων και κρατήσεων της ατομικής σου επιχείρησης";

//////////////////////////////////////////////////////////
///// wiki explaning how calculation are being made /////
////////////////////////////////////////////////////////
export const CONTENT = {
  employee: {
    title: "Υπολογισμός μισθωτού",
    subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
  },
  business: {
    title: "Υπολογισμός ελεύθερου επαγγελματία",
    subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
  },
};

export const EMPLOYEE_WIKI = [
  {
    title: "Ασφαλιστικές εισφορές",
    description:
      "Οι ασφαλιστικές εισφορές του εργαζομένου προκύπτουν από την εφαρμογή ενός ποσοσού επι το μικτού μισθού.",
    list: [],
    example: `Για ένα μικτό μηνιαίο 2000€ και με το
      ποσοστό των ασφαλιστικών εισφορών που παρακρατούνται να
      είναι στο 13.867%: μικτό μηνιαίο * 0.13867 = ασφαλιστικές
      εισφορές ανά μήνα`,
  },
  {
    title: "Φόρος εισοδήματος",
    description:
      "Για τον υπολογισμό χρησιμοποιείται το ετήσιο φορολογητέο εισόδημα αφότου γίνει η αφαίρεση τον ασφαλιστικών εισφορών, και ο φόρος υπολογίζεται κλιμακωτά.",
    list: [
      "0€-10.000€ → 9%",
      "10.000€-€20.000€ → 22%",
      "20.000€-€30.000€ → 28%",
      "30.000€-€40.000€ → 36%",
      "40.000€+ → 44%",
    ],
    example: "Με ετήσιο φορολογητέο εισόδημα 17.232€ προκύπτει:",
    exampleList: [
      "10.000€ * 0.09 = €900",
      "7.232€ * 0.22 = 1591€",
      "σύνολο = 2491€",
    ],
  },
  {
    title: "Έκπτωση φόρου",
    description:
      "Η έκπτωση φόρου εισοδήματος για μισθωτούς εξαρτάται από τον αριθμό των προστατευομενων τέκνών. Για εισοδήματα κάτω τον 12.000€ είναι οι εξής:",
    list: [
      "777€, εάν δεν υπάρχουν προστατευόμενα τέκνα",
      "810€, εάν υφίσταται ένα προστατευόμενο τέκνο",
      "900€, εάν υπάρχουν δύο προστατευόμενα τέκνα",
      "1.120€, εάν υφίστανται τρία προστατευόμενα τέκνα",
      "1.340€, εάν υφίστανται τέσσερα προστατευόμενα τέκνα",
      "επιπλέον 220€ για κάθε προστατευόμενο τέκνο από το πέμπτο και πάνω",
    ],
    afterListDescritpion:
      "Αν το εισοδήματα υπερβαίνει τα 12.000€ η έκπτωση μειώνεται κατά 20€ ανά 1.000€.",
    example:
      "Για ένα ετήσιο φορολογητέο εισόδημα 17.232€ και χωρίς προστατευόμενα τέκνα. Aρχική έκπτωση 777€. Δεδομένου ότι το ποσό υπερβαίνει τα 12.000€ κάνουμε την απαραίτητη μείωση.",
    exampleList: [
      "17.232€ - 12.000€ = 5.232€",
      "5.232€ * 0.02 = 104€",
      "777€ - 104€ = 673€",
    ],
    afterExampleList:
      "Άρα για φόρο 2491€ η έκπωση φορου θα ειναι 777€ - 104€ = 673€. Τελικός φόρος: 2491€ - 673€ = 1818€",
  },
  {
    title: "Μεταφορά φορολογικής κατοικίας στην Ελλάδα",
    description:
      "Η έκπτωση φόρου εισοδήματος για μισθωτούς εξαρτάται από τον αριθμό των προστατευομενων τέκνών. Για εισοδήματα κάτω τον 12.000€ είναι οι εξής:",
    list: [],
    example:
      "ετήσιο φορολογητέο εισόδημα * 0.5 ⇒ κλίμακες(9%, 22%, 28%, 36%, 44%)",
  },
];

export const BUSINESS_WIKI = [
  {
    title: "Φορολογητέο εισόδημα",
    description:
      "Το ποσό που φορολογείτε είναι ότι προκύπτει από το μικτό εισόδημα πλην την ασφάλιση και τα εταιρικά έξοδα.",
    example:
      "φορολογητέο εισόδημα = μικτό εισόδημα - ασφάλιση - εταιρικά έξοδα",
    exampleList: [
      "μικτό εισόδημα = €52000",
      "ασφάλιση = €1,632(€136 * 12)",
      "εταιρικά έξοδα = €4000",
      "φορολογητέο εισόδημα = €48,368",
    ],
  },
  {
    title: "Φόρος εισοδήματος",
    description:
      "Το φορολογητέο εισόδημα υπολογίζεται με βάση τους ανάλογους φορολογικούς συντελεστές.",
    list: [
      "0€-10.000€ → 9%",
      "10.000€-€20.000€ → 22%",
      "20.000€-€30.000€ → 28%",
      "30.000€-€40.000€ → 36%",
      "40.000€+ → 44%",
    ],
    example: "Με ετήσιο φορολογητέο εισόδημα €17.232 προκύπτει.",
    exampleList: [
      "€10.000 * 0.09 = €900",
      "€7.232 * 0.22 = €1591",
      "σύνολο = €2491",
    ],
  },
  {
    title: "Έκπτωση στον φόρο εισοδήματος",
    description:
      "Αν για τα 3 πρώτα έτη λειτουργείας το εισόδημα δεν ξεπερνά τα 10.000€, ο φορολογικός συντελεστής (9%) μειώνεται κατά 50%, δηλαδή η φορολογία είναι με 4,5%.",
  },
  {
    title: "Προκαταβολή φόρου",
    description:
      "Προκαταβολή φόρου είναι το 55% το φόρου που θα πληρωθεί αυτό το έτος.",
  },
  {
    title: "Έκπτωση στην Προκαταβολή φόρου",
    description: "Για τα 3 πρώτα έτη λειτουργείας υπάρχει έκπτωση 50%.",
  },
  {
    title: "Ασφαλιστικές εισφορές",
    description:
      "Κάθε επαγγελματίας θα πρέπει να δηλώνει την ασφαλιστική κλάση στην οποία ανήκει. Για τα 5 πρώτα έτη υπάρχει η ειδική κλάση.",
    list: [
      "ειδική = 148,15€",
      "1η κατηγορία = 240,25 €",
      "2η κατηγορία = 286,31€",
      "3η κατηγορία = 341,13€",
      "4η κατηγορία = 408,02€",
      "5η κατηγορία = 486,96€",
      "6η κατηγορία = 620,60€",
    ],
  },
  {
    title: "Εξοδα επιχειρησης",
    description:
      "Σαν έξοδο θεωρείται το ποσό μετά την αφαίρεση του ΦΠΑ. Τυχόν λογιστική αμοιβη όπως και ο ΕΦΚΑ υποβάλλονται και αυτά ως έξοδα.",
  },
];

export const WIKI = {
  employee: {
    header: {
      title: "Υπολογισμός μισθωτού",
      subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
    },
    content: EMPLOYEE_WIKI,
  },
  business: {
    header: {
      title: "Υπολογισμός ελεύθερου επαγγελματία",
      subtitle: "Πως υπολογίζονται κρατήσεις και εισφορές",
    },
    content: BUSINESS_WIKI,
  },
};
