export const META_TITLE =
  "Taxemu - Υπολογισμός καθαρού ή μικτού μισθού μισθωτού ή ατομικής επιχείρησης";
export const META_DESCRIPTION =
  "Το Taxemu είναι ενα open-source εργαλείο για να μπορείς να έχεις μια εικόνα των εξόδων και κρατήσεων της ατομικής σου επιχείρησης";

export const WIKI = {
  employee: {
    header: {
      title: "Υπολογισμός μισθωτού",
      subtitle: "Πώς υπολογίζονται κρατήσεις και εισφορές",
    },
  },
  business: {
    header: {
      title: "Υπολογισμός ελεύθερου επαγγελματία",
      subtitle: "Πώς υπολογίζονται κρατήσεις και εισφορές",
    },
  },
};
